README.org
#+TITLE: Daw-Ran Liou's Emacs Configuration
#+STARTUP: overview
#+PROPERTY: header-args:emacs-lisp :tangle init.el :results silent

This is an ongoing evolution of my original Emacs configuration files, inspired
by a bunch of resources I’ve found online:

- https://github.com/hlissner/doom-emacs
- [[https://github.com/daviwil/dotfiles/blob/master/Emacs.org]]
- https://github.com/daviwil/emacs-from-scratch/blob/master/Emacs.org

* Table of Contents
:PROPERTIES:
:TOC:      :include all
:END:
:CONTENTS:
- [[#table-of-contents][Table of Contents]]
- [[#early-initel][Early-init.el]]
- [[#startup-performance][Startup Performance]]
  - [[#gc][GC]]
  - [[#unset-file-name-handler-alist-temporarily][Unset file-name-handler-alist temporarily]]
  - [[#measure-the-startup-time][Measure the startup time]]
- [[#keep-emacsd-clean][Keep .emacs.d Clean]]
- [[#package-system-setup][Package System Setup]]
  - [[#blackout][Blackout]]
- [[#macos][MacOS]]
- [[#keybindings][Keybindings]]
  - [[#esc-cancels-all][ESC Cancels All]]
  - [[#rebind-c-u][Rebind C-u]]
  - [[#evil][Evil]]
  - [[#keybinding-panel-which-key][Keybinding Panel (which-key)]]
  - [[#simplify-leader-bindings-generalel][Simplify Leader Bindings (general.el)]]
  - [[#better-default-bindings][Better Default Bindings]]
- [[#ui][UI]]
  - [[#clean-up-emacs-ui-to-be-more-minimal][Clean up Emacs' UI to be more minimal]]
  - [[#display-line-number][Display line number]]
  - [[#highlight-line][Highlight line]]
  - [[#theme][Theme]]
  - [[#font-configuration][Font configuration]]
  - [[#modeline][Modeline]]
  - [[#text-scaling][Text Scaling]]
  - [[#highlight-matching-parens][Highlight Matching Parens]]
  - [[#paren-face][Paren Face]]
  - [[#window-management][Window Management]]
  - [[#highlight-fill-column][Highlight Fill Column]]
  - [[#center-buffers][Center Buffers]]
  - [[#emoji-and-unicode][Emoji and Unicode]]
  - [[#native-titlebar][Native Titlebar]]
  - [[#rainbow-mode][Rainbow Mode]]
- [[#completion][Completion]]
  - [[#selectrum][Selectrum]]
  - [[#marginalia][Marginalia]]
  - [[#ctrlf][CtrlF]]
  - [[#embark][Embark]]
  - [[#consult][Consult]]
- [[#helpful-help-commands][Helpful Help Commands]]
- [[#editing][Editing]]
  - [[#tabs][Tabs]]
  - [[#commenting-lines][Commenting Lines]]
  - [[#automatically-clean-whitespace][Automatically Clean Whitespace]]
  - [[#lisp-s-expression-editing][Lisp S-expression Editing]]
  - [[#evil-multiedit][Evil Multiedit]]
  - [[#undo-fu][Undo-fu]]
  - [[#smart-parens][Smart Parens]]
  - [[#expand-region][Expand Region]]
- [[#org-mode][Org Mode]]
  - [[#basic-config][Basic Config]]
  - [[#nicer-heading-bullets][Nicer Heading Bullets]]
  - [[#auto-tangle-configuration-files][Auto-tangle Configuration Files]]
  - [[#update-table-of-contents-on-save][Update Table of Contents on Save]]
  - [[#journal][Journal]]
  - [[#roam][Roam]]
  - [[#presentation][Presentation]]
- [[#dired][Dired]]
- [[#shell][Shell]]
  - [[#exec-path][Exec-path]]
  - [[#vterm][Vterm]]
  - [[#eshell][Eshell]]
    - [[#toggling-eshell][Toggling eshell]]
- [[#development][Development]]
  - [[#projectile][Projectile]]
  - [[#magit][Magit]]
  - [[#ripgrep][Ripgrep]]
  - [[#lsp][LSP]]
    - [[#lsp-modeel-disabled][lsp-mode.el (disabled)]]
    - [[#eglot][Eglot]]
  - [[#languages][Languages]]
    - [[#clojure][Clojure]]
    - [[#markdown][Markdown]]
  - [[#company][Company]]
  - [[#syntax-checking-with-flycheck][Syntax Checking with Flycheck]]
  - [[#spell-checking-comments-and-text][Spell Checking Comments and Text]]
  - [[#eldoc][Eldoc]]
- [[#misc][Misc]]
  - [[#world-time][World Time]]
:END:

* Early-init.el

From [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Early-Init-File.html][The Early Init File:]]

#+begin_quote
Most customizations for Emacs should be put in the normal init file. See Init
File. However, it is sometimes desirable to have customizations that take effect
during Emacs startup earlier than the normal init file is processed. Such
customizations can be put in the early init file, ~/.config/emacs/early-init.el
or ~/.emacs.d/early-init.el. This file is loaded before the package system and
GUI is initialized, so in it you can customize variables that affect frame
appearance as well as the package initialization process, such as
package-enable-at-startup, package-load-list, and package-user-dir.
#+end_quote

#+begin_src emacs-lisp :tangle early-init.el

  ;;; early-init.el -*- lexical-binding: t; -*-
  ;; NOTE: early-init.el is now generated from Emacs.org.  Please edit that file
  ;;       in Emacs and early-init.el will be generated automatically!

  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.6)
  (setq package-enable-at-startup nil)
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)
  (setq frame-inhibit-implied-resize t)

#+end_src

* Startup Performance

Source: [[https://github.com/hlissner/doom-emacs/blob/develop/docs/faq.org#how-does-doom-start-up-so-quickly][How does Doom start up so quickly?]]

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t; -*-
  ;; NOTE: init.el is now generated from Emacs.org.  Please edit that file in
  ;;       Emacs and init.el will be generated automatically!

#+end_src

** GC

The GC can easily double startup time, so we suppress it at startup by turning
up =gc-cons-threshold= (and perhaps =gc-cons-percentage=) temporarily.

#+begin_src emacs-lisp

  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.6)

#+end_src

However, it is important to reset it eventually. Not doing so will cause garbage
collection freezes during long-term interactive use. Conversely, a
=gc-cons-threshold= that is too small will cause stuttering. We use 16mb as our
default.

#+begin_src emacs-lisp

  (add-hook 'emacs-startup-hook
    (lambda ()
      (setq gc-cons-threshold 16777216 ; 16mb
            gc-cons-percentage 0.1)))

#+end_src

It may also be wise to raise =gc-cons-threshold= while the minibuffer is active,
so the GC doesn’t slow down expensive commands (or completion frameworks, like
helm and ivy). Here is how Doom does it:

#+begin_src emacs-lisp

  (defun doom-defer-garbage-collection-h ()
    (setq gc-cons-threshold most-positive-fixnum))

  (defun doom-restore-garbage-collection-h ()
    ;; Defer it so that commands launched immediately after will enjoy the
    ;; benefits.
    (run-at-time
     1 nil (lambda () (setq gc-cons-threshold 16777216)))) ; 16mb

  (add-hook 'minibuffer-setup-hook #'doom-defer-garbage-collection-h)
  (add-hook 'minibuffer-exit-hook #'doom-restore-garbage-collection-h)

#+end_src

** Unset =file-name-handler-alist= temporarily

Emacs consults this variable every time a file is read or library loaded, or
when certain functions in the file API are used (like =expand-file-name= or
=file-truename=).

Emacs does this to check if a special handler is needed to read that file, but
none of them are (typically) necessary at startup, so we disable them
(temporarily!):

#+begin_src emacs-lisp

  (defvar doom--file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)

  ;; Alternatively, restore it even later:
  (add-hook 'emacs-startup-hook
    (lambda ()
      (setq file-name-handler-alist doom--file-name-handler-alist)))

#+end_src

** Measure the startup time

#+begin_src emacs-lisp

  ;; Profile emacs startup
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))

#+end_src

* Keep .emacs.d Clean

Put backups and auto-save files in their own folders.

#+begin_src emacs-lisp

  ;; Keep backup files and auto-save files in the backups directory
  (setq backup-directory-alist
        `(("." . ,(expand-file-name "backups" user-emacs-directory)))
        auto-save-file-name-transforms
        `((".*" ,(expand-file-name "auto-save-list/" user-emacs-directory) t)))

#+end_src

Put custom settings into its own file.

#+begin_src emacs-lisp

  (setq custom-file (concat user-emacs-directory "custom.el"))
  (load custom-file 'noerror)

#+end_src

* Package System Setup

[[https://github.com/raxod502/straight.el][straight.el]] for reproducible package management.

#+begin_src emacs-lisp

  (setq straight-use-package-by-default t
        straight-build-dir (format "build-%s" emacs-version))

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

#+end_src

Emacs has a built in package manager but it doesn’t make it easy to automatically install packages on a new system the first time you pull down your configuration. [[https://github.com/jwiegley/use-package][use-package]] is a really helpful package used in this configuration to make it a lot easier to automate the installation and configuration of everything else we use.

#+begin_src emacs-lisp

  (straight-use-package 'use-package)
  ;;(setq use-package-always-defer t)

#+end_src

** Blackout

[[https://github.com/raxod502/blackout][Blackout]] is an easy way to turn off mode line lighters. It's similar to
diminish.el or delight.el. See the comparisons at:
https://github.com/raxod502/blackout.

#+begin_src emacs-lisp

  (use-package blackout
    :straight (:host github :repo "raxod502/blackout")
    :demand t)

  (blackout 'auto-revert-mode)

#+end_src

* MacOS

#+begin_src emacs-lisp

  (mac-auto-operator-composition-mode)

  (setq-default delete-by-moving-to-trash t)

  ;; Both command keys are 'Super'
  (setq mac-right-command-modifier 'super)
  (setq mac-command-modifier 'super)

  ;; Option or Alt is naturally 'Meta'
  (setq mac-option-modifier 'meta)
  (setq mac-right-option-modifier 'meta)

  (global-set-key (kbd "s-s") 'save-buffer)             ;; save
  (global-set-key (kbd "s-S") 'write-file)              ;; save as
  (global-set-key (kbd "s-q") 'save-buffers-kill-emacs) ;; quit
  (global-set-key (kbd "s-a") 'mark-whole-buffer)       ;; select all
  (global-set-key (kbd "s-k") 'kill-this-buffer)
  (global-set-key (kbd "s-=") 'text-scale-adjust)

#+end_src

* Keybindings

This configuration uses [[https://evil.readthedocs.io/en/latest/index.html][evil-mode]] for a Vi-like modal editing experience.
[[https://github.com/noctuid/general.el][general.el]] is used for easy keybinding configuration that integrates well with
which-key.  [[https://github.com/emacs-evil/evil-collection][evil-collection]] is used to automatically configure various Emacs
modes with Vi-like keybindings for evil-mode.

** ESC Cancels All

#+begin_src emacs-lisp

  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

#+end_src

** Rebind C-u

Since I let =evil-mode= take over =C-u= for buffer scrolling, I need to re-bind
the =universal-argument= command to another key sequence.  I'm choosing =C-M-u=
for this purpose.

#+begin_src emacs-lisp

  (global-set-key (kbd "C-M-u") 'universal-argument)

#+end_src

** Evil

Some tips can be found here:

- https://github.com/noctuid/evil-guide
- https://nathantypanski.com/blog/2014-08-03-a-vim-like-emacs-config.html

#+begin_src emacs-lisp

  (use-package evil
    :defer .1
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump t)
    (setq evil-move-beyond-eol t)
    (setq evil-move-cursor-back nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-normal-state-map "\C-e" 'evil-end-of-line)
    (define-key evil-insert-state-map "\C-e" 'end-of-line)
    (define-key evil-visual-state-map "\C-e" 'evil-end-of-line)
    (define-key evil-motion-state-map "\C-e" 'evil-end-of-line)
    (define-key evil-normal-state-map "\C-y" 'yank)
    (define-key evil-insert-state-map "\C-y" 'yank)
    (define-key evil-visual-state-map "\C-y" 'yank)
    (define-key evil-normal-state-map "\C-k" 'kill-line)
    (define-key evil-insert-state-map "\C-k" 'kill-line)
    (define-key evil-visual-state-map "\C-k" 'kill-line)

    ;; Get around faster
    (define-key evil-motion-state-map "gs" 'evil-avy-goto-char-timer)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal)

    (global-set-key (kbd "s-w") 'evil-window-delete))

  (use-package evil-collection
    :after evil
    :demand t
    :hook (evil-mode . evil-collection-mode)
    :config
    (evil-collection-init))

  ;; Allows you to use the selection for * and #
  (use-package evil-visualstar
    :after evil
    :hook (evil-mode . evil-visualstar-mode)
    :commands (evil-visualstar/begin-search
               evil-visualstar/begin-search-forward
               evil-visualstar/begin-search-backward)
    :init
    (evil-define-key 'visual 'global
      "*" #'evil-visualstar/begin-search-forward
      "#" #'evil-visualstar/begin-search-backward))

#+end_src

** Keybinding Panel (which-key)

[[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key
binding in Emacs to offer you all possible completions for the prefix.  For
example, if you press =C-c= (hold control and press the letter =c=), a panel
will appear at the bottom of the frame displaying all of the bindings under that
prefix and which command they run.  This is very useful for learning the
possible key bindings in the mode of your current buffer.

#+begin_src emacs-lisp

  (use-package which-key
    :blackout t
    :hook (after-init . which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))

#+end_src

** Simplify Leader Bindings (general.el)

#+begin_src emacs-lisp

  (use-package general
    :demand t
    :config
    (general-create-definer dawran/leader-keys
      :states '(normal insert visual emacs)
      :keymaps 'override
      :prefix "SPC"
      :global-prefix "C-SPC")

    (general-create-definer dawran/localleader-keys
      :states '(normal insert visual emacs)
      :keymaps 'override
      :major-modes t
      :prefix ","
      :non-normal-prefix "C-,")

    (dawran/leader-keys
      "fd" '((lambda () (interactive) (find-file (expand-file-name "~/.emacs.d/README.org"))) :which-key "edit config")
      "t"  '(:ignore t :which-key "toggles")
      "tt" '(load-theme :which-key "choose theme")
      "tw" 'whitespace-mode
      "tm" 'toggle-frame-maximized
      "tM" 'toggle-frame-fullscreen))

#+end_src

** Better Default Bindings

#+begin_src emacs-lisp

  (global-set-key (kbd "C-x C-b") #'switch-to-buffer)
  (global-set-key (kbd "C-M-j") #'switch-to-buffer)

#+end_src

* UI
