early-init.el
;;; early-init.el -*- lexical-binding: t; -*-
;; NOTE: early-init.el is now generated from Emacs.org.  Please edit that file
;;       in Emacs and early-init.el will be generated automatically!

(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6)
(setq package-enable-at-startup nil)
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)
(setq frame-inhibit-implied-resize t)
